Vange-wang/Wearing_Health_System/Code文档/固件/wrist_node/sdkconfig.defaults
# 腕部节点（ESP32-C3）sdkconfig 默认值
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_NVS_PERSIST=0
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="WH-Wrist01"
CONFIG_BT_NIMBLE_SVC_GAP_APPEARANCE_WRITE_PERM=0
